/*
Расставить на стандартной 64-клеточной шахматной доске 8 ферзей так, чтобы ни один из них не находился под боем другого
Поля:
    - Матрица для хранения информации о доске
Конструктор:
    - Принимает 4 значения х1, у1, х2, у2 положения ферзей расположенных заранее (предполагается что размещение верное)
Метод:
    - toString - вернуть строку с досской в виде квадрата
    - canPut - можно ли поставить ферзя в заданное положение
    - fillBoard - заполнить доску ферзями
    = isCorrect - вернуть true или false, в зависимости правильно ли расположены все фигуры на доске
 */

public class QueensPuzzle
{

}